using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SHFileInfo
{
    //ShellFolder::GetAttributesOf
    [Flags  ]
    public enum SFGAO : uint
    {
        // Указанные элементы могут быть скопированы.
        CanCopy = 0x00000001,
        // Указанные предметы могут быть перемещены.
        CanMove = 0x00000002,
        // Ярлыки могут быть созданы для указанных элементов.Этот атрибут имеет то же значение, что и DROPEFFECT_LINK.
        // Если расширение пространства имен возвращает этот атрибут, запись « Создать ярлык» с обработчиком по умолчанию добавляется 
        // в контекстное меню, которое отображается во время операций перетаскивания. Расширение может также реализовать свой собственный 
        // обработчик для глагола ссылки вместо значения по умолчанию. Если расширение делает это, оно отвечает за создание ярлыка.
        // Создать ярлык элемент добавляется также в Windows Explorer, File меню и обычного меню быстрого доступа.
        // Если элемент выбран, метод IContextMenu::InvokeCommand вашего приложения вызывается с lpVerb член CMINVOKECOMMANDINFO структура, 
        // чтобы ссылки . Ваше приложение отвечает за создание ссылки.
        CanLink = 0x00000004,
        // Указанные элементы могут быть связаны с IStorage объекта через IShellFolder::BindToObject.Для получения дополнительной информации 
        // о возможностях манипулирования пространством имен см. IStorage.
        Storage = 0x00000008,
        // Указанные элементы могут быть переименованы.Обратите внимание, что это значение по сути является предложением; не все клиенты 
        // пространства имен позволяют переименовывать элементы.Тем не менее, те, которые действительно должны иметь этот атрибут установлен.
        CanRename = 0x00000010,
        // Указанные элементы могут быть удалены.
        CanDelete = 0x00000020,
        // Указанные объекты имеют списки свойств.
        HasPropSheet = 0x00000040,
        // Указанные предметы являются мишенями.
        DropTarget = 0x00000100,
        // Этот флаг является маской для атрибутов возможностей: SFGAO_CANCOPY, SFGAO_CANMOVE, SFGAO_CANLINK, SFGAO_CANRENAME, SFGAO_CANDELETE, 
        // SFGAO_HASPROPSHEET и SFGAO_DROPTARGET.Абоненты обычно не используют это значение.
        CapabilityMask = 0x00000177,
        // Windows 7 и позже. Указанные элементы являются системными.
        System = 0x00001000,
        // Указанные элементы зашифрованы и могут потребовать специального представления.
        Encrypted = 0x00002000,
        // Ожидается, что доступ к элементу (через IStream или другие интерфейсы хранилища) будет медленной.Приложениям следует избегать доступа 
        // к элементам, помеченным как SFGAO_ISSLOW.
        // [!Примечание]
        // Открытие потока для элемента, как правило, всегда является медленной операцией. SFGAO_ISSLOW указывает, что ожидается, что он будет 
        // особенно медленным, например, в случае медленных сетевых подключений или автономных (FILE_ATTRIBUTE_OFFLINE) файлов. 
        // Однако запрос SFGAO_ISSLOW сам по себе является медленной операцией.Приложения должны запрашивать SFGAO_ISSLOW только в фоновом 
        // потоке. Альтернативный метод, такой как получение свойства PKEY_FileAttributes и тестирование для FILE_ATTRIBUTE_OFFLINE, 
        // может использоваться вместо вызова метода, который включает SFGAO_ISSLOW.
        IsSlow = 0x00004000,
        // Указанные элементы отображаются серым цветом и недоступны для пользователя.
        Ghosted = 0x00008000,
        // Указанные элементы являются ярлыками.
        Link = 0x00010000,
        // Указанные объекты являются общими.
        Share = 0x00020000,
        // Указанные элементы доступны только для чтения. В случае папок это означает, что новые элементы не могут быть созданы в этих папках. 
        // Это не должно быть перепутано с поведением, определенным флагом FILE_ATTRIBUTE_READONLY, полученным IColumnProvider::GetItemData 
        // в структуре SHCOLUMNDATA. FILE_ATTRIBUTE_READONLY не имеет значения для папок файловой системы Win32.
        ReadOnly = 0x00040000,
        // Элемент скрыт и не должен отображаться, если в настройках папки не включен параметр « Показать скрытые файлы и папки» .
        Hidden = 0x00080000,
        // Не использовать.
        DisplayAttrMask = 0x000FC000,
        // Предметы не перечисляются и должны быть скрыты.Они не возвращаются через перечислитель, такой как созданный методом 
        // IShellFolder::EnumObjects.
        NoneNumerated = 0x00100000,
        // Элементы содержат новый контент, как определено конкретным приложением.
        NewContent = 0x00200000,
        // ------------------------
        // Не поддерживается.
        // CanMoniker,
        // Не поддерживается.
        // HasStorage,
        // ------------------------
        // Указывает, что с элементом связан поток.Доступ к этому потоку можно получить через вызов IShellFolder::BindToObject или 
        // IShellItem::BindToHandler с IID_IStream в параметре riid.
        Stream = 0x00400000,
        // Дети этого предмета доступны через IStream или IStorage . Эти дети помечены SFGAO_STORAGE или SFGAO_STREAM.
        StorageAncestor = 0x00800000,
        // При указании в качестве входных данных SFGAO_VALIDATE указывает папке проверять наличие элементов, содержащихся в папке или массиве 
        // элементов оболочки.Если один или несколько из этих элементов не существуют, IShellFolder::GetAttributesOf и 
        // IShellItemArray::GetAttributes возвращают код ошибки. Этот флаг никогда не возвращается как значение[out]. 
        // При использовании с папкой файловой системы SFGAO_VALIDATE дает указание папке отбрасывать кэшированные свойства, 
        // полученные клиентами IShellFolder2::GetDetailsEx, которые могли накопиться для указанных элементов.
        Validate = 0x01000000,
        // Указанные элементы находятся на съемных носителях или сами являются съемными устройствами.
        Removable = 0x02000000,
        // Указанные элементы сжаты.
        Compressed = 0x04000000,
        // Указанные элементы могут быть размещены в веб-браузере или в фрейме Windows Explorer.
        Browsable = 0x08000000,
        // Указанные папки являются либо папками файловой системы, либо содержат хотя бы одного потомка (дочернего, внучатого или более позднего), 
        // который является папкой файловой системы(SFGAO_FILESYSTEM).
        FileSysAncestor = 0x10000000,
        // Указанные элементы являются папками.Некоторые элементы могут быть помечены как SFGAO_STREAM и SFGAO_FOLDER, например сжатый файл с 
        // расширением имени файла.zip.Некоторые приложения могут включать этот флаг при тестировании элементов, которые являются как файлами, 
        // так и контейнерами.
        Folder = 0x20000000,
        // Указанные папки или файлы являются частью файловой системы (то есть они являются файлами, каталогами или корневыми каталогами). 
        // Проанализированные имена элементов можно считать допустимыми путями файловой системы Win32.Эти пути могут быть UNC или буквой диска.
        FileSystem = 0x40000000,
        // Этот флаг является маской для атрибутов возможности хранения: SFGAO_STORAGE, SFGAO_LINK, SFGAO_READONLY, SFGAO_STREAM, 
        // SFGAO_STORAGEANCESTOR, SFGAO_FILESYSANCESTOR, SFGAO_FOLDER и SFGAO_FILESYSTEM.Абоненты обычно не используют это значение.
        StorageCapMask = 0x70C50008,
        // Указанные папки имеют подпапки. Атрибут SFGAO_HASSUBFOLDER носит рекомендательный характер и может быть возвращен реализациями 
        // папки Shell, даже если они не содержат подпапок. Тем не менее, обратите внимание, что в противоположном случае - при отсутствии 
        // возврата SFGAO_HASSUBFOLDER - определенно указывается, что у объектов папки нет подпапок. 
        // Возвращение SFGAO_HASSUBFOLDER рекомендуется всякий раз, когда требуется значительное количество времени, чтобы определить, 
        // существуют ли какие-либо подпапки. Например, оболочка всегда возвращает SFGAO_HASSUBFOLDER, когда папка находится на сетевом диске.
        HasSubFolder = 0x80000000,
        // Этот флаг является маской для атрибутов контента, в настоящее время только SFGAO_HASSUBFOLDER.Абоненты обычно не используют это значение.
        ContentsMask = 0x80000000,
        // Маска, используемая свойством PKEY_SFGAOFlags для определения атрибутов, которые, как считается, вызывают медленные вычисления или 
        // не имеют контекста: SFGAO_ISSLOW, SFGAO_READONLY, SFGAO_HASSUBFOLDER и SFGAO_VALIDATE.Абоненты обычно не используют это значение.
        PKeySfgaoMask = 0x81044000,
    }
}
